photoShuffle-BACKEND/app/controllers/users_controller.rb

INSERT INTO "users" ("username") VALUES (?)  [["username", "AnamS"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "dumdum"], ["LIMIT", 1]]
---
  def create
    # byebug
    user = User.find_or_create_by(username: strong_params[:username])