BACKEND/app/controllers/games_controller.rb

  def index
    games = Game.all
---
SELECT "games".* FROM "games"

  def show
    game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    new_game = Game.create(new_game_params)
---
INSERT INTO "games" ("user_id", "image_id") VALUES (?, ?)  [["user_id", 10], ["image_id", 4]]

  def update
    current_game = Game.find(params[:id])
    current_game.update(update_game_params)
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
UPDATE "games" SET "moves" = ?, "time" = ?, "status" = ?, "x1_y3" = ?, "x2_y3" = ?, "x3_y3" = ?, "x1_y2" = ?, "x2_y2" = ?, "x3_y2" = ?, "x1_y1" = ?, "x2_y1" = ?, "x3_y1" = ? WHERE "games"."id" = ?