BACKEND/app/controllers/images_controller.rb

  def index
    images = Image.all
---
SELECT "images".* FROM "images"

  def show
    image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]