BACKEND/app/controllers/users_controller.rb

INSERT INTO "users" ("username") VALUES (?)  [["username", "sikuMan"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "dumdum"], ["LIMIT", 1]]
---
  def create
    user = User.find_or_create_by(username: strong_params[:username])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."user_id" = ?  [["user_id", 10]]
---
  def show
    user = User.find(params[:id])
    bad_games = Game.where( time: "0:00:00" )
    bad_games.each {|game| game.destroy}
    users_open_games = user.games.select{|game| game.status == "open"}
    users_closed_games = user.games.select{|game| game.status == "closed"}